ComittmentIssues/BouyDev-v2/5. Development/1. Sensor Development/STM32L4/Test_FlashMem_L4/Src/DATAFLASH.c
/*
 * DATAFLASH.c
 *
 *  Created on: Nov 21, 2019
 *      Author: Administrator
 */

#include "stm32l4xx_hal.h"
#include "DATAFLASH.h"
#include <stdint.h>


/* Private variables ---------------------------------------------------------*/
#if USART1_ENABLED == 1
static UART_HandleTypeDef huart1;
#endif

#if USART2_ENABLED == 1
extern UART_HandleTypeDef huart2;
#endif

#if USART3_ENABLED == 1
static UART_HandleTypeDef huart3;
#endif
#if UART4_ENABLED == 1
extern UART_HandleTypeDef huart4;
#endif
#if UART5_ENABLED == 1
static UART_HandleTypeDef huart5;
#endif
//ADDRESS
static uint8_t Current_Address[3] = {0x00,0x00,0x00};

//Starting addresses of each sector
const uint8_t FLASH_Sector0a[3] = {0x00,0x00,0x00};
const uint8_t FLASH_Sector0b[3] = {0x00,0x08,0x00};
const uint8_t FLASH_Sector1[3]  = {0x04,0x00,0x00};
const uint8_t FLASH_Sector2[3] 	= {0x08,0x00,0x00};
const uint8_t FLASH_Sector3[3]  = {0x0C,0x00,0x00};
const uint8_t FLASH_Sector4[3]	= {0x10,0x00,0x00};
const uint8_t FLASH_Sector5[3]	= {0x14,0x00,0x00};
const uint8_t FLASH_Sector6[3]	= {0x18,0x00,0x00};
const uint8_t FLASH_Sector7[3]	= {0x1C,0x00,0x00};
const uint8_t FLASH_Sector8[3]	= {0x20,0x00,0x00};
const uint8_t FLASH_Sector9[3]	= {0x24,0x00,0x00};
const uint8_t FLASH_Sector10[3] = {0x28,0x00,0x00};
const uint8_t FLASH_Sector11[3] = {0x2C,0x00,0x00};
const uint8_t FLASH_Sector12[3] = {0x30,0x00,0x00};
const uint8_t FLASH_Sector13[3] = {0x34,0x00,0x00};
const uint8_t FLASH_Sector14[3]	= {0x38,0x00,0x00};
const uint8_t FLASH_Sector15[3]	= {0x3C,0x00,0x00};
const uint8_t FLASH_Sector16[3]	= {0x40,0x00,0x00};
const uint8_t FLASH_Sector17[3]	= {0x44,0x00,0x00};
const uint8_t FLASH_Sector18[3]	= {0x48,0x00,0x00};
const uint8_t FLASH_Sector19[3]	= {0x4C,0x00,0x00};
const uint8_t FLASH_Sector20[3] = {0x50,0x08,0x00};
const uint8_t FLASH_Sector21[3] = {0x54,0x00,0x00};
const uint8_t FLASH_Sector22[3] = {0x58,0x00,0x00};
const uint8_t FLASH_Sector23[3] = {0x5C,0x00,0x00};
const uint8_t FLASH_Sector24[3]	= {0x60,0x00,0x00};
const uint8_t FLASH_Sector25[3]	= {0x64,0x00,0x00};
const uint8_t FLASH_Sector26[3]	= {0x68,0x00,0x00};
const uint8_t FLASH_Sector27[3]	= {0x6C,0x00,0x00};
const uint8_t FLASH_Sector28[3]	= {0x70,0x00,0x00};
const uint8_t FLASH_Sector29[3]	= {0x74,0x00,0x00};
const uint8_t FLASH_Sector30[3] = {0x78,0x08,0x00};
const uint8_t FLASH_Sector31[3] = {0x7C,0x00,0x00};

//REGISTERS
static uint8_t FLASH_STATUS_REGISTER[2] = {0x00,0x00};

//BUFFERS
static uint8_t Data_r256[256] = {0x00}; //256 Byte Buffer
static uint8_t Data_r264[264] = {0x00};	//264 Byte Buffer
static uint8_t Data_rByte[1] = {0x00}; 	//Single Byte Buffer
static int _264or256 = 256;				//Keeps track of page size

//FLAGS
static int FLASH_MAX_ADDRESS_FLAG = 0;	//Keeps track of if max address has been passed

//------------------------------------------FUNCTION DEFINITIONS------------------------------------------------------------------------------------

//---------------------------------------------MISCELLEANOUS-----------------------------------------------------------------

/*
 * @Description: Function To initialise peripherals that interface with flash chips.
 * Configures the SPI settings, GPIO Settings and checks to see how many flash chips
 * are online.
 */

HAL_StatusTypeDef Init_Flash_Chips(void)
{
	//control Pin init
	MX_GPIO_Init();
	//SPI int
	if(MX_SPI_Init(SPI2,&hspi2)		!= HAL_OK) return HAL_ERROR;
	//check the status of each chip
	for (int chipnumber = 1; chipnumber < 5; ++chipnumber)
	{
		if(!FLASH_Is_Online(chipnumber))
		{
			return HAL_ERROR;
		}
	}
	return HAL_OK;
}

/*
 * @Description: Reads the Chip ID
 */
void FLASH_Get_ID(int ChipNumber,uint8_t* id)
{

	uint8_t cmd = 0x9F;
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);
	HAL_SPI_Transmit(&hspi2,&cmd,1,100);
	HAL_SPI_Receive(&hspi2,id,5,100);
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);
}

/*
 * @Description function used to verrify chips are working by reading the ID
 * A Valid ID  consists of 5 bytes with fixed values which are as follows:
 * Byte 0 = 0x1F
 * Byte 1 = 0x28
 * Byte 2 = 0x00
 * Byte 3 = 0x01
 * Byte 4 = 0x00
 * If the sequence is not valid, the function returns a 0 otherwise, the function
 * returns a 1
 */
uint8_t FLASH_Is_Online(int ChipNumber)
{
	uint8_t id[5] = {0};
	FLASH_Get_ID(ChipNumber,id);
	return (id[0] == 0x1f)&&(id[1] == 0x28)&&(id[2] == 0)&&(id[3] == 1)&&(id[4] == 0);

}
/**
  * @DESCRIPTION Opens communications with one of DATAFLASH slave devices.
  * If more chips are added this function needs to be expanded to include
  * those chips. Just Copy one of cases and change the GPIO settings to
  * match the GPIO pin and port used for the new chip.
  */
void FLASH_ChipSelect_setState(int ChipNumber, CS_State_t state)
{
	/*If more Dataflash chips are added
	 * this needs to be expanded to include their respective NSS pins*/
	switch (ChipNumber)
	{
		case 1:
	    	HAL_GPIO_WritePin(GPIO_CHIP_1_CS_PORT, GPIO_CHIP_1_CS, state);
	      break;
	    case 2:
	    	HAL_GPIO_WritePin(GPIO_CHIP_2_CS_PORT, GPIO_CHIP_2_CS, state);
	      break;
	    case 3:
	    	HAL_GPIO_WritePin(GPIO_CHIP_3_CS_PORT, GPIO_CHIP_3_CS, state);
	      break;
	    case 4:
	    	HAL_GPIO_WritePin(GPIO_CHIP_4_CS_PORT, GPIO_CHIP_4_CS, state);
	      break;
	}
}

/**
  * @DESCRIPTION Closes communications with one of DATAFLASH slave devices.
  * If more chips are added this function needs to be expanded to include
  * those chips. Just Copy one of cases and change the GPIO settings to
  * match the GPIO pin and port used for the new chip.
  */


/**
  * @DESCRIPTION Sets FLASH_STATUS_REGISTER to the Status Register of the selected Chip.
  * FLASH_STATUS_REGISTER is contained in an array containing two bytes formatted to uint8_t.
  * Notable bits include: 	Bit 7 of both Bytes 	-> RDY bit (tells if Chip is busy or not)
  * 					  	Bit 6 of Byte 1 		-> COMP bit (displays result of PageBufferCompare)
  * 					  	Bit 0 of Byte 1			-> Page Size bit (1 is 256, 0 is 264 Standard size)
  * 					  	Bit 5 of Byte 2			-> EPE bit (1 if Erase/Program Error occured in latest ERASE/WRITE operation)
  * 					  	See DataSheet for more information (Page 28-29)
  * 					  	Returns a pointer to FLASH_STATUS_REGISTER
  */
uint8_t* FLASH_GetStatusRegister(int ChipNumber)
{
	//Define Command
	uint8_t command[1] = {0xD7};

