ComittmentIssues/BouyDev-v2/5. Development/1. Sensor Development/STM32L4/Test_FlashMem_L4/Src/DATAFLASH.c
	//Open line to slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit command
	HAL_SPI_Transmit(&hspi2, command, 1, 100);

	//Update Register
	HAL_SPI_Receive(&hspi2, FLASH_STATUS_REGISTER, 2, 100);

	//Close line to slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);

	//Return pointer to FLASH_STATUS_REGISTER
	return FLASH_STATUS_REGISTER;
}

/**
  * @DESCRIPTION Constantly calls 1ms delay if the selected chip is bust with an operation
  * This is called in most functions in this library already to ensure no data corruption occurs.
  */
void FLASH_Delay(int ChipNumber)
{

	FLASH_GetStatusRegister(ChipNumber); 					//Sets FLASH_STATUS_REGISTER
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);	//Turns off OnBoard LED for visual display
	while((FLASH_STATUS_REGISTER[0])<128){					//Checks if RDY bit is off
		FLASH_GetStatusRegister(ChipNumber);				//Sets FLASH_STATUS_REGISTER for next iteration
		HAL_Delay(1);										//1ms Delay while not RDY
	}
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET);		//Turns on OnBoard LED to show Delay is finished
}

/**
  * @DESCRIPTION Returns a pointer to the 264 or 256 Byte buffer depending on current page size.
  * Called in READ functions. The Page size int is changed automatically by
  * FLASH_CONFIG_PageSize(). Static function and so is "hidden" from outside use.
  */
static uint8_t* Data_rx()
{
	if (_264or256 == 256){ 	//Checks if Page size is 256
		return Data_r256;	//Returns the 256 Byte buffer
	} else
	{
		return Data_r264;	//Returns the 264 Byte buffer
	}
}

/**
  * @DESCRIPTION Returns the current page size.
  */
int FLASH_GetPageSize()
{
	return _264or256; //Return Page size
}

//---------------------------------------------UART FUNCTIONS------------------------------------------------------------------------------------

void UART_SendData(uint8_t* Data_tx, int size)
{
	//HAL_UART_Transmit(&huart4, Data_tx, size, HAL_MAX_DELAY);
	HAL_UART_Transmit(&huart2, Data_tx, size, HAL_MAX_DELAY);
}

uint8_t* UART_ReceiveDataPage()
{
	HAL_UART_Receive(&huart2, Data_rx(), _264or256, HAL_MAX_DELAY);
	return Data_rx();
}

uint8_t* UART_ReceiveDataByte()
{
	HAL_UART_Receive(&huart2, Data_rByte, 1, HAL_MAX_DELAY);
	return Data_rByte;
}


//---------------------------------------ADDRESS MANAGEMENT-------------------------------------------------

/**
  * @DESCRIPTION Sets the current address to the entered value.
  * The AT45DB641E DATAFLASH chip works with 3 address bytes at a time so this library has a
  * uint8_t 3 element array which contains the current address. The first element Current Address[0]
  * is Most Significant Byte of the address and the last element is the Least Significant byte of the
  * address. Recommended to set the current address to {0x00, 0x00, 0x00} and then use FLASH_IncAddress
  * function to handle addressing of the chip.
  */
void FLASH_SetAddress(uint8_t MSB,uint8_t MID,uint8_t LSB)
{
	Current_Address[0] = MSB;	//Sets the Most Significant Byte of Address
	Current_Address[1] = MID;	//Sets the Middle Byte of Address
	Current_Address[2] = LSB;	//Sets the Least Significant Byte of Address
}

/**
  * @DESCRIPTION Increments the address by the number of Bytes entered.
  * The AT45DB641E DATAFLASH chip works with 3 address bytes at a time so this library has a
  * uint8_t 3 element array which contains the current address. The first element Current Address[0]
  * is Most Significant Byte of the address and the last element is the Least Significant byte of the
  * address. Recommended to be used after a FLASH READ, WRITE or ERASE operation.
  * E.g. if 256 Bytes is written to the chip then call FLASH_IncAddres(256) to move to the next empty
  * address.
  */
void FLASH_IncAddress(int size)
{
	int address = (Current_Address[0]<<16)+(Current_Address[1]<<8)+(Current_Address[2]); //Turns array into 24 bit int
	int new_address = address + size; //Increments address by number of bytes entered
	if (new_address >= FLASH_MAX_ADDRESS)	//Checks if  Address has gone over MAX_ADDRESS
	{
		new_address = new_address - FLASH_MAX_ADDRESS;	//Sets the new address to however much it went over by
		FLASH_MAX_ADDRESS_FLAG = 1;						//Sets the address flag to tell user that the MAX_ADDRESS has been passed and data overwrite is possible
	}
	Current_Address[0] = (new_address&BYTE_Mask_MSB)>>16; //Reconstructs Address Array
	Current_Address[1] = (new_address&BYTE_Mask_MID)>>8;
	Current_Address[2] = (new_address&BYTE_Mask_LSB);
}

/**
  * @DESCRIPTION Returns a pointer to Current_Address array
  */
int FLASH_GetAddress()
{
	return (Current_Address[0]<<16)+(Current_Address[1]<<8)+(Current_Address[2]); //Return current Address as 24bit int
}

/**
  * @DESCRIPTION Returns 1 if the Maximum address on the chip has been passed by FLASH_IncAddress.
  * If this occurs the DATAFLASH chip will start writing from the beginning of main memory again.
  * This can potentially result in Data corruption or loss. It is recommended to switch to another chip
  * if this FLAG has been raised.
  */
int FLASH_GetMaxAddressFlag()
{
	return FLASH_MAX_ADDRESS_FLAG; //Returns the MAX_ADDRESS_FLAG
}

/**
  * @DESCRIPTION Sets the FLASH_MAX_ADDRESS_FLAG to zero.
  * DATAFLASH chip will start writing from the beginning of main memory again if the end of memory
  * is reached. This can potentially result in Data corruption or loss. It is recommended to switch
  * to another chip if this happens. When switching to another chip use FLASH_ResetMaxAddressFlag to
  * set the FLAG to zero again.
  */
void FLASH_ResetMaxAddressFlag()
{
	FLASH_MAX_ADDRESS_FLAG = 0; //Set MAX_ADDRESS_FLAG to 0
}



//----------------------------------------------READ--------------------------------------------------------

/**
  * @DESCRIPTION READS one page of data from the Current_Address and stores it in uint8_t Data_rx[256].
  * If the next pages needs to READ then call FLASH_IncAddres(256 or 264) and then FLASH_READ_Page() again.
  * The data in Data_rx will be replaced with the new page data. Returns pointer to correct buffer.
  */
uint8_t* FLASH_READ_Page(int ChipNumber)
{
	//Define Command
	uint8_t command[8] = {0xD2, Current_Address[0], Current_Address[1], Current_Address[2], DUMMYBYTE, DUMMYBYTE, DUMMYBYTE, DUMMYBYTE};

	//Delay function if chip is busy
	FLASH_Delay(ChipNumber);

