ComittmentIssues/BouyDev-v2/5. Development/1. Sensor Development/STM32L4/Test_FlashMem_L4/Src/DATAFLASH.c
	//Open line to slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit command
	HAL_SPI_Transmit(&hspi2, command, 8, 800);

	//Update Read Buffer
	HAL_SPI_Receive(&hspi2, Data_rx(), _264or256, 5000);

	//Close line to slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);

	//Return pointer to array using Data_rx() to return correctly sized buffer
	return Data_rx();
}

/**
  * @DESCRIPTION READS one page of data from a buffer of the users choice.
  * HF in function name signifies High Frequency read and supports a SCK of 50 - 85 MHz
  */
uint8_t* FLASH_READ_BufferHF(int ChipNumber, int BUFFERx)
{
	//Define Command to be transmitted
	uint8_t OpCode;
	if (BUFFERx == BUFFER1){
		OpCode = 0xD4;
	} else if (BUFFERx == BUFFER2){
		OpCode = 0xD6;
	}
	uint8_t AddressByte = 0x00;
	uint8_t command[5] = {OpCode, DUMMYBYTE, DUMMYBYTE, AddressByte, DUMMYBYTE};

	//Delays if Flash chip is busy
	FLASH_Delay(ChipNumber);

	//Select Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit Command
	HAL_SPI_Transmit(&hspi2, command, 5, 500);

	//Receive Data
	HAL_SPI_Receive(&hspi2, Data_rx(), _264or256, HAL_MAX_DELAY);

	//Deselect Slave
	FLASH_ChipSelect_setState(ChipNumber, CS_CLOSED);

	//Return Correctly sized buffer using Data_rx()
	return Data_rx();
}

/**
  * @DESCRIPTION READS one page of data from a buffer of the users choice.
  * LF in function name signifies Low Frequency read and supports a SCK of 40 - 50 MHz
  */
uint8_t* FLASH_READ_BufferLF(int ChipNumber, int BUFFERx)
{
	//Define Command to be transmitted
	uint8_t OpCode;
	if (BUFFERx == BUFFER1){
		OpCode = 0xD1;
	} else if (BUFFERx == BUFFER2){
		OpCode = 0xD3;
	}
	uint8_t AddressByte = 0x00;
	uint8_t command[5] = {OpCode, DUMMYBYTE, DUMMYBYTE, AddressByte, DUMMYBYTE};

	//Delays if Flash chip is busy
	FLASH_Delay(ChipNumber);

	//Select Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit Command
	HAL_SPI_Transmit(&hspi2, command, 5, 500);

	//Receive Data
	HAL_SPI_Receive(&hspi2, Data_rx(), _264or256, HAL_MAX_DELAY);

	//Deselect Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);
	//Return Correctly sized buffer using Data_rx()
	return Data_rx();
}



//----------------------------------------------WRITE-------------------------------------------------------

/**
  * @DESCRIPTION WRITES one page of data through a buffer of the users choice.
  * This function needs to take in 256/264 Bytes of data in the form of 256/264 element uint8_t array.
  * Return value describes whether WRITE was successful or not. 1 = Error, 0 = Success.
  */
int FLASH_WRITE_Page(int ChipNumber, int BUFFERx, uint8_t* data)
{
	//Writes to page through buffer, if it fills buffer it starts at the beginning
	//therefore can only take 256 bytes at a time
	//Has built in erase
	//Define Command
	uint8_t OpCode;
		if (BUFFERx == BUFFER1){
			OpCode = 0x82;
		} else if (BUFFERx == BUFFER2){
			OpCode = 0x85;
		}
	uint8_t command[4] = {OpCode, Current_Address[0], Current_Address[1], 0x00};

	//Delay function if chip is busy
	FLASH_Delay(ChipNumber);

	//Open line to slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit command
	HAL_SPI_Transmit(&hspi2, command, 4, 800);

	//Transmit Data
	HAL_SPI_Transmit(&hspi2, data, _264or256, HAL_MAX_DELAY);

	//Close line to slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);

	//Returns 1 if Write was unsuccessful and 0 if successful. This is determined from EPE bit in the Status Register
	return FLASH_ADDITIONAL_GetEPEbit(ChipNumber);
}

/**
  * @DESCRIPTION WRITES a variable number of bytes through a buffer of the users choice.
  * This function takes in data in the form of a uint8_t array. The size of array needs to be specified
  * and passed into the function.
  */
int FLASH_WRITE_ReadModifyWrite(int ChipNumber, int BUFFERx, uint8_t* Data, int size)
{
	//Define Command to be transmitted
	uint8_t OpCode;
	if (BUFFERx == BUFFER1){
		OpCode = 0x58;
	} else if (BUFFERx == BUFFER2){
		OpCode = 0x59;
	}
	uint8_t command[4] = {OpCode, Current_Address[0], Current_Address[1], Current_Address[3]};

	//Delays if Flash chip is busy
	FLASH_Delay(ChipNumber);

	//Select Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit Command
	HAL_SPI_Transmit(&hspi2, command, 4, 400);
	HAL_SPI_Transmit(&hspi2, Data, size, HAL_MAX_DELAY);

	//Deselect Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);

	//Returns 1 if Write was unsuccessful and 0 if successful. This is determined from EPE bit in the Status Register
	return FLASH_ADDITIONAL_GetEPEbit(ChipNumber);
}

/**
  * @DESCRIPTION WRITES a variable number of bytes to a buffer of the users choice.
  * This function takes in data in the form of a uint8_t array. The size of array needs to be specified
  * and passed into the function.
  */
int FLASH_WRITE_Buffer(int ChipNumber, int BUFFERx, uint8_t* Data, int size)
{
	//Define Command to be transmitted
	uint8_t OpCode;
	if (BUFFERx == BUFFER1){
		OpCode = 0x84;
	} else if (BUFFERx == BUFFER2){
		OpCode = 0x87;
	}
	uint8_t command[4] = {OpCode, DUMMYBYTE, DUMMYBYTE, 0x00};

	//Delays if Flash chip is busy
	FLASH_Delay(ChipNumber);

	//Select Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit Command
	HAL_SPI_Transmit(&hspi2, command, 4, 400);
	HAL_SPI_Transmit(&hspi2, Data, size, HAL_MAX_DELAY);

	//Deselect Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);

	//Returns 1 if Write was unsuccessful and 0 if successful. This is determined from EPE bit in the Status Register
	return FLASH_ADDITIONAL_GetEPEbit(ChipNumber);
}

/**
  * @DESCRIPTION Transfers the contents of a buffer of the users choice to a page in memory.
  * The address of the page is the Current_Address Variable.
  */
int FLASH_WRITE_BufferToPage(int ChipNumber, int BUFFERx)
{
	//Define Command to be transmitted
	uint8_t OpCode;
	if (BUFFERx == BUFFER1){
		OpCode = 0x83;
	} else if (BUFFERx == BUFFER2){
		OpCode = 0x86;
	}
	uint8_t command[4] = {OpCode, Current_Address[0], Current_Address[1], DUMMYBYTE};

