ComittmentIssues/BouyDev-v2/5. Development/1. Sensor Development/STM32L4/Test_FlashMem_L4/Src/DATAFLASH.c
	//Delays if Flash chip is busy
	FLASH_Delay(ChipNumber);

	//Select Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit Command
	HAL_SPI_Transmit(&hspi2, command, 4, 400);

	//Deselect Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);

	//Returns 1 if Write was unsuccessful and 0 if successful. This is determined from EPE bit in the Status Register
	return FLASH_ADDITIONAL_GetEPEbit(ChipNumber);
}

/**
  * @DESCRIPTION WRITES to a page in main memory through Buffer 1 and can write up to 256 Bytes.
  * The size of the uint8_t data array needs to specified and passed in the function.
  */
int FLASH_WRITE_PageOrByte_NoErase(int ChipNumber,  uint8_t* Data, int size)
{
	//Only writes through buffer 1
	//Define Command to be transmitted
	uint8_t OpCode = 0x02;
	uint8_t command[4] = {OpCode, Current_Address[0], Current_Address[1], 0x00};

	//Delays if Flash chip is busy
	FLASH_Delay(ChipNumber);

	//Select Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit Command
	HAL_SPI_Transmit(&hspi2, command, 4, 400);
	HAL_SPI_Transmit(&hspi2, Data, size, HAL_MAX_DELAY);

	//Deselect Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);

	//Returns 1 if Write was unsuccessful and 0 if successful. This is determined from EPE bit in the Status Register
	return FLASH_ADDITIONAL_GetEPEbit(ChipNumber);
}

/**
  * @DESCRIPTION WRITES Transfers the contents of a buffer of the users choice to a page in memory.
  * The address of the page is the Current_Address Variable. This function has no built in erase and
  * an ERASE function needs to be called before this function is called.
  */
int FLASH_WRITE_BufferToPage_NoErase(int ChipNumber, int BUFFERx)
{
	//Define Command to be transmitted
	uint8_t OpCode;
	if (BUFFERx == BUFFER1){
		OpCode = 0x88;
	} else if (BUFFERx == BUFFER2){
		OpCode = 0x89;
	}
	uint8_t command[4] = {OpCode, Current_Address[0], Current_Address[1], DUMMYBYTE};

	//Delays if Flash chip is busy
	FLASH_Delay(ChipNumber);
	//Select Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);
	//Transmit Command
	HAL_SPI_Transmit(&hspi2, command, 4, 400);

	//Deselect Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);

	//Returns 1 if Write was unsuccessful and 0 if successful. This is determined from EPE bit in the Status Register
	return FLASH_ADDITIONAL_GetEPEbit(ChipNumber);
}



//----------------------------------------------ERASE-------------------------------------------------------

/**
  * @DESCRIPTION ERASES a page from the currently selected chip at the Current_Address.
  * Default erase value is 1 for each bit. This operation takes approx. 7 - 35ms.
  */
int FLASH_ERASE_Page(int ChipNumber)
{
	//Define Command
	uint8_t command[4] = {0x81, Current_Address[0], Current_Address[1], DUMMYBYTE};

	//Delay function if chip is busy
	FLASH_Delay(ChipNumber);

	//Open line to slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit command
	HAL_SPI_Transmit(&hspi2, command, 4, 100);

	//Close line to slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);

	//Returns 1 if ERASE was unsuccessful and 0 if successful. This is determined from EPE bit in the Status Register
	return FLASH_ADDITIONAL_GetEPEbit(ChipNumber);
}

/**
  * @DESCRIPTION ERASES a Block of 8 pages from the currently selected chip at the Current_Address.
  * Default erase value is 1 for each bit. This operation takes approx. 25 - 50ms.
  */
int FLASH_ERASE_Block(int ChipNumber)
{
	//Define Command to be transmitted
	uint8_t OpCode = 0x50;
	uint8_t command[4] = {OpCode, Current_Address[0], Current_Address[1], DUMMYBYTE};

	//Checks if device is busy
	//If busy it delays the function
	FLASH_Delay(ChipNumber);

	//Select Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit Command
	HAL_SPI_Transmit(&hspi2, command, 4, 400);

	//Deselect Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);

	//Returns 1 if ERASE was unsuccessful and 0 if successful. This is determined from EPE bit in the Status Register
	return FLASH_ADDITIONAL_GetEPEbit(ChipNumber);
}

/**
  * @DESCRIPTION ERASES a Sector of 128 Blocks from the currently selected chip at the Current_Address.
  * Default erase value is 1 for each bit. This operation takes approx. 2.5 - 6.5s.
  * Note Secto0a only has 1 block and Sector0b has 127 blocks.
  */
int FLASH_ERASE_Sector(int ChipNumber)
{
	//Define Command to be transmitted
	uint8_t OpCode = 0x7C;
	uint8_t command[4] = {OpCode, Current_Address[0], Current_Address[1], DUMMYBYTE};

	//Checks if device is busy
	//If busy it delays the function
	FLASH_Delay(ChipNumber);

	//Select Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit Command
	HAL_SPI_Transmit(&hspi2, command, 4, 400);

	//Deselect Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);

	//Returns 1 if ERASE was unsuccessful and 0 if successful. This is determined from EPE bit in the Status Register
	return FLASH_ADDITIONAL_GetEPEbit(ChipNumber);
}

/**
  * @DESCRIPTION ERASES Entire Chip.
  * Default erase value is 1 for each bit. This operation takes approx. 80 - 208s.
  */
int FLASH_ERASE_Chip(int ChipNumber)
{
	//Define Command to be transmitted
	uint8_t command[4] = {0xC7,0x94,0x80,0x9A};

	//Checks if device is busy
	//If busy it delays the function
	FLASH_Delay(ChipNumber);

	//Select Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit Command
	HAL_SPI_Transmit(&hspi2, command, 4, 400);

	//Deselect Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);

	//Returns 1 if ERASE was unsuccessful and 0 if successful. This is determined from EPE bit in the Status Register
	return FLASH_ADDITIONAL_GetEPEbit(ChipNumber);
}



//---------------------------------------SUSPEND AND RESUME-------------------------------------------------

/**
  * @DESCRIPTION SUSPENDS the current WRITE/ERASE operation in a sector so other operations can take place.
  * Will set either PS1 or PS2 bit in the Status Register to 1  (bit 1 or 2).
  */
void FLASH_SUSPEND(int ChipNumber)
{
	//Define Command to be transmitted
	uint8_t command[1] = {0xB0};

