ComittmentIssues/BouyDev-v2/5. Development/1. Sensor Development/STM32L4/Test_FlashMem_L4/Src/DATAFLASH.c
	//Select Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit Command
	HAL_SPI_Transmit(&hspi2, command, 1, 100);

	//Deselect Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);
}

/**
  * @DESCRIPTION RESUMES the current WRITE/ERASE operation in a sector so other operations can take place.
  * Will set either PS1 or PS2 bit in the Status Register to 1  (bit 1 or 2). If an ERASE and WRITE are
  * suspended it will resume the WRITE first. This command must be issued again to resume the ERASE.
  */
void FLASH_RESUME(int ChipNumber)
{
	//Define Command to be transmitted
	uint8_t command[1] = {0xD0};

	//Select Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit Command
	HAL_SPI_Transmit(&hspi2, command, 1, 100);

	//Deselect Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);

}



//--------------------------------------ADDITIONAL COMMANDS-------------------------------------------------

/**
  * @DESCRIPTION Transfers a page in main memory at Current_Address to a buffer of the users choice.
  * */
void FLASH_ADDITIONAL_PageToBuffer(int ChipNumber, int BUFFERx)
{
	//Define Command to be transmitted
	uint8_t OpCode;
	if (BUFFERx == BUFFER1){
		OpCode = 0x53;
	} else if (BUFFERx == BUFFER2){
		OpCode = 0x55;
	}
	uint8_t command[4] = {OpCode, Current_Address[0], Current_Address[1],DUMMYBYTE};

	//If Chip is Busy cause a Delay
	FLASH_Delay(ChipNumber);

	//Select Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit Command
	HAL_SPI_Transmit(&hspi2, command, 4, 400);

	//Deselect Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);
}

/**
  * @DESCRIPTION Compares a page in main memory at Current_Address to a buffer of the users choice.
  * Sets the COMP bit in the Status Register to 1 if the page and buffer match.
  * Can be used to check if a successful BufferToPage operation has been performed.
  * */
int FLASH_ADDITIONAL_PageBufferCompare(int ChipNumber, int BUFFERx)
{
	//Define Command to be transmitted
	uint8_t OpCode;
	if (BUFFERx == BUFFER1){
		OpCode = 0x60;
	} else if (BUFFERx == BUFFER2){
		OpCode = 0x61;
	}
	uint8_t command[4] = {OpCode, Current_Address[0], Current_Address[1],DUMMYBYTE};

	//Checks if device is busy
	//If busy it delays the function
	FLASH_Delay(ChipNumber);

	//Select Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit Command
	HAL_SPI_Transmit(&hspi2, command, 4, 400);

	//Deselect Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);

	///Gets the COMP bit from the STATUS REGISTER and returns it
	FLASH_GetStatusRegister(2);
	int COMP = (FLASH_STATUS_REGISTER[0]&(0x40))>>6;
	return COMP;
}

/**
  * @DESCRIPTION Rewrites the page at Current_Address to ensure data integrity.
  * Needs to be called ever 50 000 WRITE/ERASE operation done to a page.
  * */
void FLASH_ADDITIONAL_AutoPageRewrite(int ChipNumber, int BUFFERx)
{
	//Define Command to be transmitted
	uint8_t OpCode;
	if (BUFFERx == BUFFER1){
		OpCode = 0x58;
	} else if (BUFFERx == BUFFER2){
		OpCode = 0x59;
	}
	uint8_t command[4] = {OpCode, Current_Address[0], Current_Address[1],DUMMYBYTE};

	FLASH_Delay(ChipNumber);

	//Select Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit Command
	HAL_SPI_Transmit(&hspi2, command, 4, 400);

	//Deselect Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);
}

int FLASH_ADDITIONAL_GetEPEbit(int ChipNumber)
{
	FLASH_GetStatusRegister(ChipNumber); 			//Update STATUS REGISTER
	int EPE = (FLASH_STATUS_REGISTER[1]&0x20)>>5;	//Extract EPE bit
	return EPE;										//Return EPE bit

}


//--------------------------------------CONFIGURE DATAFLASH-------------------------------------------------

/**
  * @DESCRIPTION CONFIGURES the page size to 256 Byte or 264 Byte Standard size.
  * */
void FLASH_CONFIG_PageSize(int ChipNumber, int StdOr256)
{
	//Define Command to be transmitted
	uint8_t command[4] = {0};
	if (StdOr256 == 256)
	{
		command[0] = 0x3D;
		command[1] = 0x2A;
		command[2] = 0x80;
		command[3] = 0xA6;
		_264or256 = 256; 	//Sets Page size int to 256
	} else
	{
		command[0] = 0x3D;
		command[1] = 0x2A;
		command[2] = 0x80;
		command[3] = 0xA7;
		_264or256 = 264;	//Sets Page size int to 264
	}

	//Checks if device is busy
	//If busy it delays the function
	FLASH_Delay(ChipNumber);

	//Select Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_OPEN);

	//Transmit Command
	HAL_SPI_Transmit(&hspi2, command, 4, 400);

	//Deselect Slave
	FLASH_ChipSelect_setState(ChipNumber,CS_CLOSED);
}


/**
  * @brief System Clock Configuration done by CubeMX
  * @retval None
  */


/**GPIO AND SPI TYPEDEFs FROM HAL LIBRARY FOR DOCUMENTATION PURPOSES
//SPI Structure
 typedef struct
{
  uint32_t Mode;                !< Specifies the SPI operating mode.
                                     This parameter can be a value of @ref SPI_Mode

  uint32_t Direction;           !< Specifies the SPI bidirectional mode state.
                                     This parameter can be a value of @ref SPI_Direction

  uint32_t DataSize;            !< Specifies the SPI data size.
                                     This parameter can be a value of @ref SPI_Data_Size

  uint32_t CLKPolarity;         !< Specifies the serial clock steady state.
                                     This parameter can be a value of @ref SPI_Clock_Polarity

  uint32_t CLKPhase;            !< Specifies the clock active edge for the bit capture.
                                     This parameter can be a value of @ref SPI_Clock_Phase

  uint32_t NSS;                 !< Specifies whether the NSS signal is managed by
                                     hardware (NSS pin) or by software using the SSI bit.
                                     This parameter can be a value of @ref SPI_Slave_Select_management

  uint32_t BaudRatePrescaler;   !< Specifies the Baud Rate prescaler value which will be
                                     used to configure the transmit and receive SCK clock.
                                     This parameter can be a value of @ref SPI_BaudRate_Prescaler
                                     @note The communication clock is derived from the master
                                     clock. The slave clock does not need to be set.

  uint32_t FirstBit;            !< Specifies whether data transfers start from MSB or LSB bit.
                                     This parameter can be a value of @ref SPI_MSB_LSB_transmission

  uint32_t TIMode;              !< Specifies if the TI mode is enabled or not.
                                     This parameter can be a value of @ref SPI_TI_mode

  uint32_t CRCCalculation;      !< Specifies if the CRC calculation is enabled or not.
                                     This parameter can be a value of @ref SPI_CRC_Calculation

