ComittmentIssues/BouyDev-v2/5. Development/1. Sensor Development/STM32L4/Test_FlashMem_L4/Src/DATAFLASH.c
  uint32_t CRCPolynomial;       !< Specifies the polynomial used for the CRC calculation.
                                     This parameter must be an odd number between Min_Data = 1 and Max_Data = 65535

  uint32_t CRCLength;           !< Specifies the CRC Length used for the CRC calculation.
                                     CRC Length is only used with Data8 and Data16, not other data size
                                     This parameter can be a value of @ref SPI_CRC_length

  uint32_t NSSPMode;            !< Specifies whether the NSSP signal is enabled or not .
                                     This parameter can be a value of @ref SPI_NSSP_Mode
                                     This mode is activated by the NSSP bit in the SPIx_CR2 register and
                                     it takes effect only if the SPI interface is configured as Motorola SPI
                                     master (FRF=0) with capture on the first edge (SPIx_CR1 CPHA = 0,
                                     CPOL setting is ignored)..
} SPI_InitTypeDef;


//GPIO Structure
typedef struct
{
  uint32_t Pin;        !< Specifies the GPIO pins to be configured.
                           This parameter can be any value of @ref GPIO_pins

  uint32_t Mode;       !< Specifies the operating mode for the selected pins.
                           This parameter can be a value of @ref GPIO_mode

  uint32_t Pull;       !< Specifies the Pull-up or Pull-Down activation for the selected pins.
                           This parameter can be a value of @ref GPIO_pull

  uint32_t Speed;      !< Specifies the speed for the selected pins.
                           This parameter can be a value of @ref GPIO_speed

  uint32_t Alternate;  !< Peripheral to be connected to the selected pins
                            This parameter can be a value of @ref GPIOEx_Alternate_function_selection
}GPIO_InitTypeDef;
*/
/*SPI pins are configured when HAL_SPI_Init() is called in DATAFLASH.c.
 * HAL_SPI_Init() is called by MX_SPI2_Init (defined in stm32l4xx_hal_spi.c) and calls HAL_SPI_MspInit()
 * which is defined in stm32l4xx_hal_msp.c. The pins used for the SPI interface
 * are set to PB13 -> SCK, PB14 -> MISO, PB15 -> MOSI by default in HAL_SPI_MspInit().
 * */

/**
  * @brief UART4 Initialization Function
  * @param None
  * @retval None
  */
HAL_StatusTypeDef MX_UART_Init(USART_TypeDef *USARTx, UART_HandleTypeDef *huart)
{


		huart->Instance = USARTx;
		huart->Init.BaudRate = USART_BaudRate;
		huart->Init.WordLength = USART_WordLength;
		huart->Init.StopBits = USART_StopBits;
		huart->Init.Parity = USART_Parity;
		huart->Init.Mode = USART_Mode;
		huart->Init.HwFlowCtl = USART_HwFlowCtl;
		huart->Init.OverSampling = USART_OverSampling;
		huart->Init.OneBitSampling = USART_OneBitSampling;
		huart->AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
		if (HAL_UART_Init(huart) != HAL_OK)
		{
			return HAL_ERROR;
		}
		return HAL_OK;
}


/**
  * @brief SPI2 Initialization Function
  * @param None
  * @retval None
  */
HAL_StatusTypeDef MX_SPI_Init(SPI_TypeDef *SPIx, SPI_HandleTypeDef *hspi)
{

	//For stm32L4 Nucleo 64 board there are 3 SPI peripherals
		/* SPI1 parameter configuration*/
		hspi->Instance = SPIx;										//Determines Which SPI is being used
		hspi->Init.Mode = SPI_MODE;									//Determines if in Master or Slave Mode
		hspi->Init.Direction = SPI_DIRECTION;						//Determines if Full or Half Duplex is used
		hspi->Init.DataSize = SPI_DATASIZE;							//Determines Datasize to be sent across
		hspi->Init.CLKPolarity = SPI_CLKPolarity ;					//Determines if Clock idles High or Low
		hspi->Init.CLKPhase = SPI_CLKPhase;							//Determines if signal sampled on Rising or falling edge of clock
		hspi->Init.NSS = SPI_NSS;									//Determines if Slave select is Hardware or Software enabled
		hspi->Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER;		//Determines the SPI and therefore Slave clock speed
		hspi->Init.FirstBit = SPI_FIRSTBIT;							//Determines if LSB or MSB first
		hspi->Init.TIMode = SPI_TIMODE;								//Determines if TI mode is used
		hspi->Init.CRCCalculation = SPI_CRCCALCULATION;				//Enables CRC Calculation
		hspi->Init.CRCPolynomial = SPI_CRCPOLYNOMIAL;				//Sets the CRC Polynomial
		hspi->Init.CRCLength = SPI_CRCLENGTH;						//Sets the CRC length
		hspi->Init.NSSPMode = SPI_NSSPMODE;							//Sets the NSSP mode
		if (HAL_SPI_Init(hspi) != HAL_OK)
		{
			return HAL_ERROR;
		}

		return HAL_OK;
}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  //GPIO Ports Clock Enable
  GPIO_RCC_Init();

  //SET PIN STATE
  GPIO_PIN_STATE_Init();

  /*Configure J6 Input pin
  GPIO_InitStruct.Pin = GPIO_PIN_2;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
   */

  /*Configure GPIO pins : PC0 PC1 PC3 */
  /*
   * Chips 1,2 have CS lines running to PC0 and PC1
   * All chips have wp on PC3
   */
  GPIO_InitStruct.Pin =  GPIO_CHIP_1_CS|GPIO_CHIP_2_CS|GPIO_CHIP_WP;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIO_CHIP_1_CS_PORT, &GPIO_InitStruct);

  /*Configure GPIO pins : PA4 */
  //for Chip 4 CS
  GPIO_InitStruct.Pin = GPIO_CHIP_4_CS;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIO_CHIP_4_CS_PORT, &GPIO_InitStruct);

  /*Configure GPIO pin : PB0 */
  //for Chip 3 CS
  GPIO_InitStruct.Pin = GPIO_CHIP_3_CS;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIO_CHIP_3_CS_PORT, &GPIO_InitStruct);

