ComittmentIssues/BouyDev-v2/5. Development/1. Sensor Development/STM32L4/Test_FlashMem_L4/Src/DATAFLASH.c
}

void GPIO_RCC_Init(void)
{
	//GPIOA
	  if(RCC_GPIOA_CLK_ENABLE){
		  __HAL_RCC_GPIOA_CLK_ENABLE();
	  } else {
		  __HAL_RCC_GPIOA_CLK_DISABLE();
	  }

	  //GPIOB
	  if(RCC_GPIOA_CLK_ENABLE){
		  __HAL_RCC_GPIOB_CLK_ENABLE();
	  } else {
		  __HAL_RCC_GPIOB_CLK_DISABLE();
	  }

	  //GPIOC
	  if(RCC_GPIOA_CLK_ENABLE){
		  __HAL_RCC_GPIOC_CLK_ENABLE();
	  } else {
		  __HAL_RCC_GPIOC_CLK_DISABLE();
	  }

	  //GPIOD
	  if(RCC_GPIOA_CLK_ENABLE){
		  __HAL_RCC_GPIOD_CLK_ENABLE();
	  } else {
		  __HAL_RCC_GPIOD_CLK_DISABLE();
	  }

	  //GPIOE
	  if(RCC_GPIOA_CLK_ENABLE){
		  __HAL_RCC_GPIOE_CLK_ENABLE();
	  } else {
		  __HAL_RCC_GPIOE_CLK_DISABLE();
	  }

	  //GPIOF
	  if(RCC_GPIOA_CLK_ENABLE){
		  __HAL_RCC_GPIOF_CLK_ENABLE();
	  } else {
		  __HAL_RCC_GPIOF_CLK_DISABLE();
	  }

	  //GPIOG
	  if(RCC_GPIOA_CLK_ENABLE){
		  __HAL_RCC_GPIOG_CLK_ENABLE();
	  } else {
		  __HAL_RCC_GPIOG_CLK_DISABLE();
	  }

	  //GPIOH
	  if(RCC_GPIOA_CLK_ENABLE){
		  __HAL_RCC_GPIOH_CLK_ENABLE();
	  } else {
		  __HAL_RCC_GPIOH_CLK_DISABLE();
	  }

}

void GPIO_PIN_STATE_Init()
{
	/*Configure GPIOS pin Output Level */
	  HAL_GPIO_WritePin(GPIOA, GPIOA_PINS, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(GPIOA, ~GPIOA_PINS, GPIO_PIN_RESET);

	  /*Configure GPIOB pin Output Level */
	  HAL_GPIO_WritePin(GPIOB, GPIOB_PINS, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(GPIOB, ~GPIOB_PINS, GPIO_PIN_RESET);

	  /*Configure GPIOC pin Output Level */
	  HAL_GPIO_WritePin(GPIOC, GPIOC_PINS, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(GPIOC, ~GPIOC_PINS, GPIO_PIN_RESET);

	  /*Configure GPIOD pin Output Level */
	  HAL_GPIO_WritePin(GPIOD, GPIOD_PINS, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(GPIOD, ~GPIOD_PINS, GPIO_PIN_RESET);

	  /*Configure GPIOE pin Output Level */
	  HAL_GPIO_WritePin(GPIOE, GPIOE_PINS, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(GPIOE, ~GPIOE_PINS, GPIO_PIN_RESET);

	  /*Configure GPIOF pin Output Level */
	  HAL_GPIO_WritePin(GPIOF, GPIOF_PINS, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(GPIOF, ~GPIOF_PINS, GPIO_PIN_RESET);

	  /*Configure GPIOG pin Output Level */
	  HAL_GPIO_WritePin(GPIOE, GPIOG_PINS, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(GPIOE, ~GPIOG_PINS, GPIO_PIN_RESET);

	  /*Configure GPIOH pin Output Level */
	  HAL_GPIO_WritePin(GPIOF, GPIOH_PINS, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(GPIOF, ~GPIOH_PINS, GPIO_PIN_RESET);

}


/**
* @brief SPI MSP Initialization
* This function configures the hardware resources used in this example
* @param hspi: SPI handle pointer
* @retval None
*/
//void HAL_SPI_MspInit(SPI_HandleTypeDef* hspi)
//{
//	  GPIO_InitTypeDef GPIO_InitStruct = {0};
//	  if(hspi->Instance==SPI2)
//	  {
//	  /* USER CODE BEGIN SPI2_MspInit 0 */
//
//	  /* USER CODE END SPI2_MspInit 0 */
//	    /* Peripheral clock enable */
//	    __HAL_RCC_SPI2_CLK_ENABLE();
//
//	    __HAL_RCC_GPIOB_CLK_ENABLE();
//	    /**SPI2 GPIO Configuration
//	    PB13     ------> SPI2_SCK
//	    PB14     ------> SPI2_MISO
//	    PB15     ------> SPI2_MOSI
//	    */
//	    GPIO_InitStruct.Pin = GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15;
//	    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
//	    GPIO_InitStruct.Pull = GPIO_NOPULL;
//	    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
//	    GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
//	    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
//
//  /* USER CODE BEGIN SPI2_MspInit 1 */
//
//  /* USER CODE END SPI2_MspInit 1 */
//  }
//
//}
//
///**
//* @brief SPI MSP De-Initialization
//* This function freeze the hardware resources used in this example
//* @param hspi: SPI handle pointer
//* @retval None
//*/
//void HAL_SPI_MspDeInit(SPI_HandleTypeDef* hspi)
//{
//  if(hspi->Instance==SPI2)
//  {
//  /* USER CODE BEGIN SPI2_MspDeInit 0 */
//
//  /* USER CODE END SPI2_MspDeInit 0 */
//    /* Peripheral clock disable */
//    __HAL_RCC_SPI2_CLK_DISABLE();
//
//    /**SPI2 GPIO Configuration
//    PC2     ------> SPI2_MISO
//    PC3     ------> SPI2_MOSI
//    PB10     ------> SPI2_SCK
//    */
//    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15);
//
//  /* USER CODE BEGIN SPI2_MspDeInit 1 */
//
//  /* USER CODE END SPI2_MspDeInit 1 */
//  }
//
//}


